[
{"name": ["Lee T.", "TheScoskopp", "TheScoskopp", "cl", "Amazon Customer", "J. Barz", "Jon Rowe", "Jon Rowe", "Bronco", "Shauna Cartwright", "Ashley G.", "Cheryl B."], "title": ["A great portable machine for daily use.  Mediocre gaming machine.", "It’s been a while since I’ve given 5 stars: See Review", "Quality Product", "Listing is wrong as of Jan 11 2023", "Excellent Laptop", "This is a well rounded budget gaming laptop", "Decent laptop for casual gamers.", "(edited 12/7/2022) I LOVE this computer, its become my daily driver.", "Great for Sims and Skyrim", "Be forewarned, short battery life"], "date": ["Reviewed in the United States on December 18, 2022", "Reviewed in the United States on December 18, 2022", "Reviewed in the United States on December 9, 2022", "Reviewed in the United States on January 12, 2023", "Reviewed in the United States on December 31, 2022", "Reviewed in the United States on January 15, 2023", "Reviewed in the United States on September 9, 2022", "Reviewed in the United States on November 24, 2022", "Reviewed in the United States on January 6, 2023", "Reviewed in the United States on January 12, 2023"], "body": ["I bought this as a replacement for a Dell Inspiron that decided to abruptly fail.  I had been wanting to get a laptop that had a dedicated graphics card, a backlit keyboard, good system specs, upgradeability, at a good price.", "Throw in the fact that Asus includes one year of ACCIDENT PROTECTION, and this is a winner!!", "  While only having this laptop for a couple of days (Edit: Weeks now) now, I am so far, not disappointed with the purchase.", "  Here are my initial impressions, the pros and the cons.", "  Pros:", "  Audio:  The onboard speakers are quite adequate.  While not some of the \"loudest\" they are more than needed for watching youtube, hearing system alerts, recreational music,  video calls, stuff like that.  I have not yet tried the speakers while gaming.  [Edit] Ok these speakers are definitely high volume.  Watching youtube, I have the speakers at 50% and the audio of the video at 5% !  And I'm worried that the people across the hall might be kept awake while I insomnia the night away.  Also for the fact that these are laptop speakers, the quality is REALLY good.  I've been listening to MP3s on this machine and its been quite satisfactory.  I had a soundbar on my older \"gaming\" laptop, because the speakers were crap.  Definitely not the case here.", "  The screen:  The screen is very good resolution, quite bright, and very comfortable to read on.  Whether in regular daylight, a lit room, or in the dark.  I have not yet tested it as far as gaming.", "  CON:  This screen is SMALL.  Coming from laptops with 17.3\" screens, this is quite an adjustment.  The screen does have very small, thin bezels, so it does a good job giving you the most screen for footprint.  However, as somebody who does a lot of video and text editing, this is not what I would really want.  If I were working with 3d models, I would definitely want an external monitor or two.", "  It also does NOT fold flat.  This is no problem at all for me.  But for those that are looking for a device that will do so, this is not it.  [Edit]  Finding the settings to adjust saturation, color balance, stuff like that, I can't find it!  And when I'm editing images, this screen has a very high yellow saturation.  So unless I can find, or download something that will let me see colors the way their meant to be, and external monitor is going to another costly expenditure.", "  Build Quality.  So far, this machine is quite sturdy.  The materials are good, and it doesn't feel like I am going to break it.  Or worry about having problems with it in my backpack.  Everything fits together very nicely.  Also when removing the bottom shell to get into the guts of the machine, I didn't feel like I was going to break it, or anything else, while using the spreader to pop the clips apart.  I do recommend the proper tool for the job tho.  Don't just try to jerk it apart after taking all those screws out.", "  Keyboard:  As with any new laptop, getting used to the key layout is almost always a chore.  There is no unified layout for the specialty keys.  For just typing, the layout is REALLY good.  The keys are spaced together Just Right, and doesn't cause me to make as many typos as my larger machines, where the keys are spaced further apart.", "  They are very tactile, and make very little noise.  They don't have the feel of mechanical keyswitches.  They may be membrane keys, or a combination.  [Edit]  Membrane keys.  I would rather have switches personally, as it's less to replace, if one key, or a couple of keys fail.  But they work really well in this machine.", "Other than when I have the machine sitting awkwardly on my lap, I have absolute NO problems typing on this, and can hit the keys that I'm aiming for quite intuitively, with very little in the way or typos induced by the machine.", "  The backlighting is GREAT.  I can very clearly see and read the keys in low, and no light.  I do wish that they could use combined colors, so that I could set one part of the keyboard to one color, and a different part to a different color.  Which really assists in gaming, using keyboard shortcuts.  But for me, that's not a dealbreaker.  I can read them in the dark, and that is what I was wanting.", "  The layout for the specialty keys is \"Fairly\" standard.  Tho the sleep mode key being on F11 and especially the airplane mode being on F12 is something that is not a wise choice as those are pretty common shortkeys for quite a few programs.", "  Mouse:  The mouse functioned quite well, right out of the box.  I do wish that it was set a bit further to the left, in an offset style.  As the butts of my thumbs do pass across the pad.  But for a laptop this size, you get what you get.  The cursor sweeps across the screen quite well, with minimal effort, right out of the box.  Big plus.  It also uses hardwared mouse buttons.  Not corner clicks on the mousepad.  Honestly, thats a HUGE win, IMO.  The corner click system I've never really liked, its an area that collects dust and crud, and has to be cleaned.  Whether this suits you or not, well, that's individual taste ;)", "CON: This mousepad collects oil.  It collects oil REALLY bad.", "  Weight:  This machine is VERY PORTABLE.  The weight is quite light.  I was actually very surprised when I opened the box.  I almost wondered if there was something missing.", "  Between the machine itself, and the power brick, this is QUITE light.  My Sager laptop is a brick.  The powerbrick is huge and weighs a ton.  This machine is most definitely a very welcomed upgrade from that!", "  Noise:  This machine really surprised me as far as the (lack of) noise from the fans.  I have had cooling pads with fans in them that have made more noise than the cooling system in", "  this machine!  ASUS has really outdone themselves with the cooling system.  Tho as stated, I haven't tried gaming on this thing yet.  But so far, the noise level from this is", "  quite pleasant, and very unobtrusive.  [Edit] Ok, so the fans have kicked on.  They are no means loud, compared to some of the other laptops that I have owned.  It's actually pretty subdued, for laptop fans.", "Somebody else had mentioned that they sound kind of like airplane turbines.  Yeah!  They actually kind of do! :D  Which is cool!  But again, they're fairly quiet.  I seriously doubt that they would bother anybody except for maybe a fairly light sleeper.", "  Heat:  Again, a very pleasant surprise!  I've run this machine a straight, solid 24 hours, and have not had the fans kick on high.  There is no hot air blowing out of the side ports, and it's extrememly comfortable on the lap.  (One of my HP laptops has literally left bald spots on my legs from the heat!)", "  Upgrades:  There are two slots for RAM.  Which are the standard open the clips, slide the new one in/out variety.  This makes upgrading the RAM very simple.  There are two slots for m2 type Solid State boards, which are spaced widely apart.  This is not only making it very easy for install/removal, but also for heat control.", "  Next to the battery, (NOT removable!) [Edit]  (The battery IS removable.  Just not externally like older laptops.  You have to open it up, disconnect it, and then it can be removed/swapped. )  There is a connector for a 2.5\" SATA drive.  Which included connectors.  I myself don't like the idea of putting a drive that close to the battery.  But considering how little this machine is, and how little space there is inside... it has to go somewhere, right?  And at least, we can add a 3rd drive!", "  Boot up:  With the operating system installed on a SSD, this machine boots up really fast.  Granted windows will really slow it down when it decides to do a mandatory update.", "  But without those, I press the power up button and within seconds, I'm typing in my password.  Very nice!", "  Speed:  So far the processor/RAM/SSD combination is a winner.  Even Adobe Photoshop CS6 fires right up.  Haven't tried it with gaming so far, but so far, my intensive programs aren't suffering any kind of slow-down, stuttering, or lag.  The exception to this is my browser.  I run A LOT OF TABS when I am surfing.  And browsers are heavy RAM hogs.  Yeah, one of my browsers is getting a lot of hesitation.  But that will go away when I upgrade RAM.", "CONS", "  Size:  As I said before, this is a very small, portable machine.  In that aspect it is fantastic!  However.  The palm rest is small enough that if you use an external mouse  there is VERY little room on the palmrest to put a mouse on it, much less use it.  I am constantly running the mouse over the arrow keys and part of the numpad.  This has caused me problems as those keys interact with programs, when I don't want them to!  This for me, is a huge con, as I really do use a laptop ON my LAP.", "  The screen is also small.  While I don't have very good eyes anymore, it's clear and easy to read.  But for some of the applications that I use my machines for, a larger, external monitor is going to be a must.", "  Windows 11:  This is a personal choice.  I myself believe that Microsoft went in a very, very bad direction with the latest release of their OS.  I will be backtracking the Operating System on this machine backwards to Windows 10 at the very first opportunity.  [Edit]  I really do hate this operating system.  The look of it is similar, but much different in ways that I don't like.  I also do not like the way that MS did the new taskbar.  The right click context menus are also way, way different, and very much not to my liking. [Edit] I found how to revert the context menus, looking around on the web.", "Especially since the changes that they made to the right click context menus are NOT compatible with a lot of the software that I use.", "  Disassembly:  Ok.  This is a pro/con situation.  Taking this machine apart to get to the guts is actually really simple.  There are 11 screws holding the plate underneath to", "  the machine.  They are easy to take out, and the plate is fairly easy to remove.", "  HOWEVER.  These screws are all different lengths!  So you HAVE to keep track of which one goes where!", "  NON-Removable  External battery:  This is an obvious con.  Not only can you not carry around a spare, but you cannot easily replace the existing one, if it goes bad. [Edit] As I noted before, yeah the battery can be replaced, but you have to open up the lower shell.  It's not a hot swappable battery that we got used to on older machines.", "  RAM slots.  Ok, this was a huge let down for me.  I was planning to simply take out the RAM from the machine that died, and put it in here to upgrade the low 8gb of ram that", "  it comes with.  It doesn't FIT!!  The pin arrangement is different, and the slot in the board is spaced further to the left.  I will have to look up what RAM this thing takes and purchase new boards to perform the upgrade.", "HOWEVER.  And this... this is awesome.  There's only ONE 8gb stick in this machine, when it arrived.  NOT paired 2x 4gb sticks.  What that means is that I can just throw another 8gb stick in here, and double the memory.  Without having to sacrifice a stick that was already in it.  Because it wasn't already in it!  Or, I could just throw in a single 16gb stick and instantly TRIPLE the ram, at significantly less coss.  I'm reading conflicting information about how much this machine supports.  Most say it's 32gb, while some say 64gb.", "I am more inclined to believe 32, but I don't know for sure.", "  Expansion slots:  Pretty much all of the connectors for USB, Video Out, and audio are all on the left side.  This, since an external monitor is going to be a must, will cause", "  some arrangement problems.  It could cause problems for people that also will be using this on a desk.  One thing that I love about my older Dell laptops is that they have some", "  of the afore mentioned ports at the BACK of the machine.  Or at the Rear Corners.", "  More USB ports would also be a very nice addition.", "  No Optical Drive.  Maybe I'm just a dinosaur, but I do miss having an optical drive bay.  Being able to watch DVDs or burn disk was a habit from way back in the day.  Or just taking the tray out, and swapping in a 2.5 sata drive through an adapter was also a very seriously nice option.  Ahhhh, progress LOL.", "  8 Gb of ram:  This combined with Win11, the LOAD of software marked with ASUS, and that crapware McCaffee pre-installed...  the machine is running at around 50% memory usage.  The Asus Monitoring software, along with the bloated goat OS is taking up quite bit of the system memory.  After uninstalling worthless McCaffee, I've cut it down to about 40% with 8gb RAM.", "  And as stated above, this machine takes different RAM boards than those used by machines from a few years ago.", "  512 GB Solid State Storage:  Ok.  This is a pro/con situation.  512 is quite good, in comparison to what similar machines are offering, which is half that.  At the same", "  pricepoint as these machines.  And as mentioned above, the machine will support up to 1tb storage boards, or SATA drive.  So there is definitely room for expansion with this machine.  However, to do so, IS an added expense.  And if you are planning on adding on a lot of games to this, you are definitely going to want to expand on the storage capacity!  Fortunately, it does have a sata slot.  Which means that you can add in a 1tb sata drive for considerably less money.", "Overall, the only thing that I'm going to complain about, is the size of the palm rests.  It's very comfortable for typing on.  But, as most of the applications that I use, I need those concise, accurate mouse movements.  And not having room to use a mouse on this machine is going to be a problem.", "That, and having to purchase windows 10 and what I will have to go through reinstalling drivers.  But again, that's a personal choice.", "Well , where to begin, ….. I review a lot of tech in my profession and I am very impressed with this product.", "  I initially bought this for business and of course the occasional gaming ;) This thing is a beast still ! I upgraded the ram to 32gb and everything else I kept the same and it’s handled everything I’ve thrown at it from games AAA titles to video editing and much more .", "  Now,  the CPU/GPU is not the newest it’s about 2 years old in the tech world but it still packs a punch, starting from the seller , to deliver , and presentation , it came in perfect condition.It’s been a long time since I had not a single complaint. This was the smoothest purchase I have had in a while .", "  The build quality is great , the I/O has everything you need , it’s all around a total package. I’d say it’s great for the average Joe to a power user.", "  It also is future proofed as everything is upgradable which is also nice. It has a ram card of DDR4 3200mhz that can be maxed out to 60gb’s and super easy to work on. I can happily answer any regular or advanced questions for anyone that has them. This honestly was a steal for the price and a 2 year warranty.", "  I love the screen, it has the matte finish to cut down on glare, I am also glad the laptop is backlit, and I can put it to one color although it can pulse , strobe and a slew of other options  but I always felt RGB screams “a 14 year olds first game rig” which I am sure gamers will get it, so it’s nice to choose a color and stay there.  The keyboard and trackpad is super responsive, and feel nice.  I was actually really impressed with the sound quality as I also use a MacBook Pro for business and they just have great sound but this ASUS just romps ! It sounds good .", "  Another nice thing was it’s actually is as advertised, no surprises and it is specked out the way it said it was . My only suggestion is to immediately jump up to 16gb of ram and you can buy it as a bundle, I’d suggest the “crucial” brand of ram sticks they have never let me down or had any compatibility issues.", "  Obviously there isn’t a whole lot I can say that the posting does not but I can say once actually getting it in your hands the listing doesn’t do it justice , it’s really nice. I’ll say it again the seller was great , I had it rushed shipped and it was here earlier than planned, the box and presentation was spot on and the PC performs , isn’t that what it’s about ?", "  It does the job and it’s durable and well made. If your looking for a entry level gaming laptop that realistically can be upgraded to a mid range gaming PC , this is it . I saw the 2022 version of this TUFF laptop and honestly you’d be best getting this one at this price point which is a late 2020 model and Its basically the same laptop other than internals( obviously). If there was one thing I would like to have change is the bloat these companies put on the PC. I really don’t mind windows 11 it’s a welcomed change. I requested a clean install , unfortunately and I get it , it’s just business and the way these companies work together to make money but it would have been nice to not have to wipe it and debloat the machine. However I will always recommend to do so anyway as it makes a huge difference. That’s really the only meh vibe I had to say about this awesome product and let’s be real , there will always be bloat from anywhere you buy new machine from. Just run a clean install of win11 and you’re golden!", "  Before I forget the battery life is actually pretty good I saw others saying otherwise but again a clean install of windows 11 will definitely improve that, the screen has a decent brightness maybe if it had 1 more level up it would be perfect otherwise this is as close as to a all inclusive total package your gonna get.", "  Great price for a great machine . Best of luck and I hope this helps someone make a decision, if you have questions feel free to ask away , I’m a straight shooter and happy to help! Happy Holidays!", "Pros:  Excellent Purchase. I replaced this ASUS with a previous ASUS laptop that I own, in which it still works very well. The back screen panel was cracked and I put duck tape on it to keep it from cracking when I closed it. But it never affected the functionality. I only purchased another ASUS due to working remote at times and I need to have something ready if it completely broke. I had the previous ASUS laptop for maybe 7 years or longer. That is good quality. I previously had a HP (before that ASUS) and that thing got so much virus activity that it could never work efficiently. When I got that ASUS - I knew it was the best purchase. I had that ASUS updated for space and it ran so fast I never wanted to replace it. This is why I kept using that laptop. Best purchase I ever made, thanks to my son telling me to purchase that ASUS. Once again, my son chose this  ASUS laptop as a replacement for my old ASUS. I am not a gamer (but he is), but a person that streams and need a lot of speed to work fast. This laptop is great. I like the picture screen pixel. Clear. The speed is magnificent. Everything was easy to set up. My son started it and set it up and added google chrome and I set up all other things that I used. It was easy to do. It is fast and efficient. I am not a gamer so I can't tell you about that. The fan, you can hear it when it is working. It doesn't bother me. It doesn't come on all the time. The keyboard lights up. The windows 11, I like, but I haven't used it to its full potential. I am pleased with this purchase. I will always invest in ASUS laptops if I ever need another one. Now I have 2 fully functioning ASUS laptops.", "Overall the laptop is great and ability to expand and upgrade ram and storage is a huge plus at this price point.  However the pictures on the listing as of today Jan 11 2023 state it has a 90Wh battery.  This is false it only contains a 48Wh battery.  Amazon is the only place I have been able to find that list this particular model with a 90Wh battery.  Asus has also confirmed that this model doesn't not have the option for 90Wh battery and comes from the factory at 48Wh.  I belive Amazon has used the stock photos of another laptop in this listing by mistake.  Amazon offered to refund my money if I sent the item back in but I already have it set up and I do not completey trust that reseting it back to factory or reinstalling windows is secure enough after having my personal info already on it.", "I actually bought this from Amazon's Warehouse as a return - and I am so glad I did.  I love this laptop.  My 70+ pound Great Pyrenees stepped on it when closed and left a huge scratch in the cover and it didn't affect the machine at all!  The case is truly tough, and with 4 dogs, that was a requirement.  As far as operating system, it's fast, does everything I need it to, and has a good battery life.  The keyboard is a bit different, definitely geared towards gaming, but I like having a numbers keyboard again (my last few laptops did not).  The only downside to this laptop is the weight - I had gotten used to very thin, light weight laptops.  However, in the end, the need for a good, tough case outweighed (literally) my desire for a light weight laptop.  I would definitely recommend this laptop.", "There is very little to dislike, the display is very clear and bright. It runs very smooth, even when playing a taxing game. Though I have noticed that games tend to load up very slow if the PC is not plugged in. I'm sure it has something to do with power saver mode. I love the backlite keyboard, and dedicated WASD keys. I am missing a finger on my left hand and the way the keys are configured makes it a lot easier to play when a controller can not be used. Honestly I was very hesitant about buying this laptop. I have been traveling a lot lately for work and this thing has just been great to have on long trips and boring days in my motel room.", "--Note, after 3 weeks of owning i decided to return this. I stand by my review, i feel the laptop is good for casual gaming, but i ended up wanting to PC game full time, and this wasn't going to cut the mustard.", "This is my first gaming PC, and overall its good.", "For the price, i think its a great snag, BUT if you plan on using this PC as your main gaming station, or plan on playing every game out there, id buy something else.", "This PC has run every game ive thrown at it, but it runs noticeably worse when running newer games, or higher demanding games.", "You wont be getting 144 frames on majority of games without dropping every graphics setting to low, and even after that you most likely will not get 144 frames.", "Max i was able to get for Insurgency Sandstorm was 80ish, Ready or not 80ish,  Death Stranding 60, Madden 23 60, Apex Legends 120s, GTA 4 60s. I had to run these games on low settings to get these frames, and it wasn't steady. I was dropping down to the 20-30 ALOT when playing Insurgency and Ready or Not. Even GTA4 was pretty janky while driving and shooting.", "I got max Frames in Valorant, Counter Strike GO, and all older games like Fallout 4, Skyrim, Left4Dead 2 i was able to play on ultra graphics.", "Graphics card is meh. I can easily notice the graphics dropoff when playing Apex and Madden on here, then hopping on Series X and playing them, its a steep drop off. The issue is you cant play a majority of games on medium or high settings, which also hurts the graphics big time.", "The screen is excellent. Its anti glare, and very clear. Its very well made, but 15inches is quite small, so an upgraded side monitor might be needed.", "Battery is pretty bad, but i usually always have it plugged in. Just web browsing at 50% brightness youre getting 2 hours battery life.", "I see some reviews claiming that the Wifi adapter is bad, i havent experienced this. I game upstairs on wifi, my router is downstairs, and i usually get 25 ping in online games, which is pretty great. I also got 150ish download on steam. Ive never gotten buffering when watching a video, or live stream(I watched the Bills vs Rams game last night on this without any buffering).", "I highly recommend upgrading the ram if you do end up buying, the max this PC can use is 24 RAM, so i installed the Crucial RAM 16GB DDR4 3200MHz CL22, very easy install.", "Speeds for the PC are very fast. From web browsing, to gaming, to tab switching, everything is very fast, even faster than my Macbook 2020.", "Overall its a solid gaming laptop, just go in knowing the limitations going in. Id recommend for casual /light gamers.", "update: had this baby for about a month. I'm an apple fanatic, and I love how integrated Apple makes everything. Texting from my computer is definitely a missed feature for me.", "But alas, I enjoy games and my two macs have trouble running the game, and the screens also both cracked at the same time, making it impossible to play games but still manageable to do other stuff. Again, i'm an apple fanatic but needed a new computer and didn't wanna spend insane amounts of money just for a new computer.", "I have had absolutely no problems out of this computer. It runs league of legends, sims, and steam games flawlessly without needing any adjustments. The computer automatically goes into performance mode when you're playing a game. The other reviewers are correct about how loud it can get with the fans, but it becomes white noise to me eventually. Its not distracting enough to not be ignored, especially if you are already watching something, you'll barely notice it.", "Even with the fans running, my ocmputer does not EVER get hot. This is the first time i've ever had a computer not get severely hot to the touch when gaming for long periods of time.", "The keyboard is so fun to type on, and this computer can handle a LOT of tasks at the same time. I absolutely love it, even if its windows. And now I can play other games, as Apple Store games or others are harder to play on macs.", "If you are considering this as a christmas present for a computer fanatic (me), or someone who plays lots of games (esp multiplayer), they will fall in love with it! And I kinda love how big the screen is. Watching stuff is so nice with this large screen!", "I’m pretty dedicated to the Sims - I’ve got all packs (and like, one kit…kits are dumb) and about 70 gigs of CC including gameplay", "mods. I play Sims 4 on Ultra visual settings and it is FLAWLESS. I have absolutely no idea if this would work for anything outside of Sims or Skyrim, but if you’re here for either of those games, definitely buy it. Just a side note: unless you’re going to upgrade your memory/storage/c drive/whatever it is that maxes out when you download a ton of stuff, I’d stick to one or two games you’re really dedicated to. This thing doesn’t come prepared for a TON of stuff. You’ll need to upgrade if you’re looking for a lot of memory/storage.", "The unit overall is spot on for gaming or most other uses; I really did enjoy it.  The small battery is the weakness of the laptop - very dismal battery life.  A huge plus is that basically, every component can be upgraded.  Rather than changing out the batt and adding ram, I returned it.  My next Amazon laptop will have a larger battery."]},
{"name": ["Danielle S.", "Bryan Gabriel", "Roberta Taylor", "Matthew Bracken", "Ginger Cruz", "Ginger Cruz", "Brooke Deane", "Gary Sanchez", "KMP", "David Cassens", "Marie"], "title": ["Great gaming laptop", "easy to use", "Perfect for me!", "Good laptop", "Outstanding Gaming Laptop", "Finally the one I wanted!", "impresionante", "Very happy with this laptop", "Great gaming and general laptop.", "Laptop"], "date": ["Reviewed in the United States on January 5, 2023", "Reviewed in the United States on January 23, 2023", "Reviewed in the United States on April 30, 2022", "Reviewed in the United States on January 7, 2023", "Reviewed in the United States on January 8, 2023", "Reviewed in the United States on December 19, 2022", "Reviewed in the United States on December 26, 2022", "Reviewed in the United States on December 23, 2022", "Reviewed in the United States on January 13, 2023", "Reviewed in the United States on December 26, 2022"], "body": ["I bought this gaming laptop for my 11 year old son who is just starting out on pc gaming. He absolutely loves it! It's very easy to use, has good quality and the screen has a beautiful display. He loves the light up keyboard as well. The price was very good for the quality of the laptop. Highly recommend", "very nice product at all... need to upgrade a lil bit specially the ram though", "For clarity, this review is for the 15.6\" GTX 1650 version, not the 17.3\" GTX 1650Ti version.", "Positives!", "This laptop is perfect for me and what I need right now. I am currently in between homes, over the road a lot for work and have all of my stuff in storage, including my main PC, so I bought a laptop so I could continue doing work and gaming while on the go.", "This laptop is not top of the line by any means, it's no $2,000 laptop with an RTX 3080 or anything like that, but if you want a good mid-range laptop that can get 60FPS on some everyday gaming, this is as good as mid-range laptops get in my opinion.", "Even on my main, much beefier PC, I've never been one to crank up the settings and enable raytracing, 4k etc. I'm more of a framerate type of person and this laptop does a great job getting high frame rates if you're willing to adjust the settings accordingly. The screen is a clean 1920x1080, lovely quality (though the brightness isn't that great), comes with an NVME 512GB hard drive which is not a bad start if you're not trying to install a Call of Duty game with 100gb patches, but that leads into another glowing positive - this thing is upgradeable and I love it! One of the hardest things about picking a laptop for me is the eventual obsolescence, so in the few times I've bought a laptop in my life, I prefer ones you can upgrade which will allow you to skirt by the expected lifespan for a bit longer.", "Overall, my complaints a few, but I will point them out.", "Negatives!", "Honestly, 8GB of RAM is... well, it's not enough for any modern PC that you want to do more than browse the internet, but this negative hardly counts against it because once again, it is upgradeable! I added 32GB to mine and it runs like a dream now. The fact it ships with such low RAM is forgivable because that's probably why the price of entry is as low as it is.", "I also had a few problems with the Wi-Fi antenna at first, which I know is not unique to my laptop, but after a few online searches, troubleshooting and settings adjustments, it hasn't dropped the connection for a couple of days, so I think I'm over that hump.", "My last complaint and honestly maybe the only one that could be considered \"major\" is the screen brightness. To be clear, I'm talking about BRIGHTNESS, not QUALITY. The resolution is wonderful and the screen is a clear HD experience, but keep this thing away from the sunlight if you want to see it easily... I took it to the park one day and while I could see the screen, I felt like I was squinting, and I had to change my preferred dark mode to light mode just to see the Windows UI better. Once again, I consider this a minor gripe and won't take a star off, because if you're using this thing indoors or in appropriate shade, the screen is beautiful.", "Overall, if you're looking for an affordable, upgradeable, laptop suited for everyday gaming (as long as you're not trying to push max settings, 4k or raytracing), you won't be disappointed!", "This had a few mishaps when I first got it but a great laptop overall. Would recommend to anybody looking for a cheap but reliable laptop.", "Bought this for my son's Christmas gift and he was very happy. The color changing is next level especially he's a gamer. Excellent product highly recommend.", "I’ve returned 4 other laptops over the past 2 years, finally this is the one I’ve kept. This is terrific bang for buck, I added a second stick of 8GB ram as I use it mainly for music production. No complaints and possibly the last laptop with a clickable mouse pad where the buttons actually press in.", "una muy bonita computadora, ya anteriormente habia comprado la Tuf Gaming 17 y me gusto tanto que le regale a mi hijo esta Tuf Gaming 15. es una muy buena computadora con un excelente relacion precio beneficio.", "I wasn't planning to use this for gaming but now I do.  Great as an everyday laptop.  It has enough memory and the refresh speed is more than enough for my purposes.  It is also not any heavy as I though it would be.", "Great gaming and general laptop!", "Ever time I try to play fornite it disconnects or  I glitch I don’t think it’s the settings  as well when I’m clicking the volume button it doesn’t do nothing"]},
{"name": ["Tiffany", "GABRIEL CALDERON", "Meme Master", "Randy Lakin", "ABDUL AZEEZ AZLAFF", "Michelle Degrandez", "James Butler", "Adam Culley", "Mohamed Haail", "Cherish Esebei"], "title": ["Great little machine!", "Latop", "Decent specs for the price, amazing cooling system.", "ASUS TUF is a fantastic machine", "Good gaminh laptop.", "A good option for gamers.", "Great value for Lower Tier Gaming Laptop", "Great laptop for the price", "Battery issue", "Becareful"], "date": ["Reviewed in the United States on December 30, 2022", "Reviewed in the United States on January 8, 2023", "Reviewed in the United States on August 30, 2022", "Reviewed in the United States on December 9, 2022", "Reviewed in the United States on January 4, 2023", "Reviewed in the United States on December 31, 2022", "Reviewed in the United States on January 23, 2023", "Reviewed in the United States on October 15, 2022", "Reviewed in the United States on January 21, 2023", "Reviewed in the United States on December 18, 2022"], "body": ["My 11 year old nephew is in heaven with his new gaming laptop. Works great with fortnight and roblox!", "Excelente Pc para jugar y trabajar", "I got this product on sale for $599, and it is more than worth the price.", "Pros:", "-Battery life is fairly decent. The only time the battery would burn itself was when I was using additional monitors and graphic intense activities at the same time. Even when the battery may be low, the charge speed is very powerful, and you should have full charge in an hour even if your using the laptop.", "-Processor is a beast. i5 10300H has the firepower to run some games that normally require high specs. Dark Souls III runs very smoothly on normal settings, haven't been able to test Elden Ring yet. (This may require more ram.) I'm also able to hook up a monitor, among other peripherals, as well as have other things open, like Discord, without a problem.", "-Screen. With 144hz (or 144 visible frames per sec.), you don't need additional monitors to see just how good your games are running.", "-RGB Keyboard. Can change how the lights appears, as well as their intensity, or turn them off if you don't need them.", "Cons:", "-RAM. With only 8gbs of RAM, you may yourself upgrading to something more using the extra empty RAM slot. Luckily, this laptop is designed to be easily upgraded with a poppable bottom. All you need are screwdrivers that fit and a RAM cartridge of your choice.", "-Storage. Again, with only 512gb of space, you may find yourself upgrading using the empty extra M.2 SSD spot. One thing to keep in mind is that this laptop will only support up to Gen 3, so make sure to save some money and not but a Gen 4 SSD, as you will not get the full power out of it.", "-Graphics Card. The GTX 1650 isn't exactly the best graphics card out there, but it gets by for meeting recommended settings on older games, while meeting minimum requirements for newer more graphic intense games.", "I purchased an ASIS TUF F15.  I bought the basic system and also purchased a 32GB ram chip and a 1TB m.2 card.  The Asus is so easy to upgrade.  It took me 30 minutes to go from 8GB of ram and 512GB to a PC with 32GB ram and 1.5GB storage.  Love my ASUS TUF F15 game machine.", ".", "Best for gaming.", "A good option for gamers.", "Compared other companies these Tuff laptops are great value but for price it is hard to complain. This replacement for the last Tuff laptop that had AMD chip of 2020. Even though listens says only one slot for extra SSD there was extra bay for HDD 2.5”. Highly recommend upgrading ram for better performance. The GRX 1650 is enough for my needs and have desktop for AAA games. I use for online school and light games. Bios is user friendly and was able to do duo booting into a Linux distribution. Battery is biggest complaint but with additional support was able to keep it unplugged for 6-8 where standard battery was 2 hours. Was able to use docking station with multiple monitors", "[Edit as of 12/02/2022. I put this laptop through quite a few more modern games and found that it stutters quite a bit, even on lower settings. I tested New World, World of Warcraft, Apex Legends, and elder scrolls online. Frame rates drop pretty significantly if any action happens in those games. Be aware that modern games are playable, but you will see some stutters.]", " I recently purchased this laptop on a lightning deal off of Amazon. I have to say, it was well worth the money! In my short time owning this laptop, I've put it through multiple gaming tests, workload tests, and just day-to-day usage. As such, I will write a pros/cons list to demonstrate the strengths and weaknesses of this laptop so you can decide for yourself if it's a worthwhile purchase.", "Pros:", "-Keeps up with most modern games, even with the dated GTX 1650 GPU.", "-It's FAST. Oddly faster than most higher-end laptops I've purchased in the past.", "-I actually really enjoy the typing on this laptop. It's not clicky, but not entirely silent. It's nice!", "-It's incredibly customizable. You can change the color of the keyboard, the pattern the lights show, and even control the fan speed from the keyboard... which leads me to my cons list.", "Cons:", "-The fans in this laptop are stupidly loud. As in, I feel like my laptop is taking off from a runway like an airplane. While gaming, it's not so much an issue because you typically wear a headset. While working, however, it can be annoying at times. And God forbid you have to take this laptop to a college class or into public, because people will probably look in your direction to figure out if it's indeed your laptop making so much noise or if there's a tornado headed in their direction. Using an app to determine fan speed and decibel level, the fans are at a constant 50 decibels while gaming, which is pretty freaking loud.", "-The screen could be better. It's not a bad screen by any means, but colors are just kind of in the middle of the spectrum.", "In summary: Buy this laptop if you're comfortable wearing a headset all the time. If not, this laptop probably isn't for you.", " Battery not working after unplugging the charger", "Cute BUT DELIVERED TO THE WRONG ADDRESS so if you buy it be careful"]},
{"name": ["dardoncas", "Amazon Customer", "Austin", "Natalia E. ", "frankie worthington", "Lady Caicedo", "mdm646", "A. Mace", "Amazon Customer", "Krystle Gardiner"], "title": ["Glad I decided to purchase", "laptop is awesome!!", "Help", "Good for me", "Battery life", "Entregar en casillero es más seguro", "Great price - but", "Wonderful little laptop", "Great laptop for the price", "Good deal"], "date": ["Reviewed in the United States on October 17, 2022", "Reviewed in the United States on September 6, 2022", "Reviewed in the United States on December 7, 2022", "Reviewed in the United States on September 18, 2022", "Reviewed in the United States on December 15, 2022", "Reviewed in the United States on November 29, 2022", "Reviewed in the United States on November 11, 2022", "Reviewed in the United States on August 21, 2022", "Reviewed in the United States on November 12, 2022", "Reviewed in the United States on December 3, 2022"], "body": ["I admit that I comparison shopped a lot of various laptops in various pricing categories.  I admit I am not a heavy \"gamer\" but from time to time I enjoy playing Gears of War or Halo and sometimes simpler things like Risk.  My libraries are, for the most part, all on Xbox Game Pass and on Steam and thus far this laptop is doing great.  Seems to manage temps well, plays the games smooth and for having a 10th gen processor and the GTX 1650 on board, its handling what I need it to without breaking the bank.  I am very glad I decided to go with this laptop!", "I will say that almost immediately I upgraded the RAM from 8gb to 16gb, put in a second 512GB PCIe NVMe M.2 SSD card and installed a 1TB internal hard drive (thanks to a couple laptops we had laying around to donate parts!) and its ready to go.", "If you are on the fence and are a moderate gaming user like me, don't be afraid to pick this one up!", "this is my first time having a asus laptop and it is just excellent! The multicolor backlit keyboards are beautiful and the computer is looks and feel very sturdy. The features  are very convenient; i can see my phone notifications, transfer calls from my phone to my laptop, and drag tabs to my phone with myasus and xglide. it has three modes: silent, performance, and turbo which I find very useful for different task. However, I gave it a 4 star because the battery life isn't as long as they describe and also one of the keyboard's keys fell out and I had to reattach but it was minor problem so not that serious. I’m also writing this to disclose about my 90 day extended warranty.", "I loved the laptop made", "R make the switch from console to pc would like to see if I can sell to get better pc parts", "I’m not a huge gamer, but I love playing the sims 4 and a few other easy games on my time off. The only thing that I noticed having this laptop is that the battery runs out very quickly when I’m just doing regular stuff like browsing through, I always have to have it plugged in so I can have a good time playing. Other than that, I’m happy with what I got. Runs the games smoothly & everything else works just fine. I’m just not going to use it when I have no where to plug it, I guess.", "Great laptop not so great battery life", "El artículo funciona correctamente pero prefiero que me entreguen los productos en el casillero así sea un poco más tarde, porque lo dejaron fuera del lobby de la unidad.", "So far so good but can't find a builtin microphone :((", "My hubby is the big PC gamer, I am a consol peasant. However, there are certain games we have been itching to play together and they are either not cross platform within game or just PC only. When we saw this deal I thought \"well my old laptop is laggy AF and has no memory and was never meant for gaming\" so we decided to get this in place of a full blown PC set up (which we didn't have space for even if I wanted it).", "But I am impressed, for a medium serious gamer, the battery life is decent, i play over wifi and it's still great without ethernet cable. They designed really well so it doesn't overheat and does not require external cooling fans, as the air blows out the back, I would suggest giving it a few inches from the wall which most people do anyway because the air blowing out can be pretty warm.", "The laptop is quiet but the fans do make some background noise but it's not bothersome, and I hardly notice it when playing a game only when shutting it down.", "Overall I'm very happy with it! I would recommend this brand if anyone asked me.", "Works great for the gaming I do which is not a lot looks great all the lights and has a webcam also I like you can upgrade the ram for me I did not need to as I use it for some steam games I recommend this for anyone who wants a budget friendly labtop. Doesn’t want to spend 1,000 plus for a labtop.", "It's a really good gaming laptop so far. My kid loves it."]},
{"name": ["Albert Bao", "Chunks", "Fernando Guerrero", "Mauricio Palacios", "Lenorsea  Jones", "Lucas H.", "DOE BOY", "Fernando Torres Bernhard", "Duane Raeburn", "RonniBG"], "title": ["Very fast Quality", "Surprised", "Computadora", "Sorprendentemente buen sonido.", "You can't go wrong!", "Linux works well on it", "It is awesome", "Muy buena computadora", "nice gaming computer", "WOW!!! I am so pleased at my purchase..."], "date": ["Reviewed in the United States on September 7, 2022", "Reviewed in the United States on November 12, 2022", "Reviewed in the United States on December 9, 2022", "Reviewed in the United States on October 14, 2022", "Reviewed in the United States on November 8, 2022", "Reviewed in the United States on September 25, 2022", "Reviewed in the United States on November 28, 2022", "Reviewed in the United States on October 20, 2022", "Reviewed in the United States on October 15, 2022", "Reviewed in the United States on October 5, 2022"], "body": ["I love it, its pretty good! Was able to play ROBLOX in high quality level and it made the experience so much better since this laptop has a very fast speed quality.  I'm also very satisfied with the battery life. However sometimes when I open a browser, it sometimes take a little while but at least faster then my old laptop I've had and saved a lot of my time. That's all I have to say and ty ^w^", "I've always had extremely bad luck with laptops. Most laptops don't last me 3 months. This gaming laptop is lasting longer than any other ones I've ever bought. I'm extremely pleased with the graphics, quality, brightness adjustments, lightning on keyboard and having a number key pad is a major plus.", "Muy util", "Vida de la batería baja, se calienta rápido, pero el sonido de los parlantes es bastante bueno y el diseño es bonito.", "This is my fav laptop thus far. I am now trying to get into gaming as an older millennial female who is somewhat tech savvy. Batteries dies pretty fast though. Laptop is lighter than my last, a bit smaller but pretty decent design.", "I'm not a fan of Windows at all, however I decided to leave it as dual boot with Linux. As is usually the case with laptops, battery life is much better in Windows than it is in Linux. That is an inherent issue with Linux and not a detriment to the laptop itself.", "Running Arch Linux, all of the hardware was found automatically. The only issue is not being able to cycle through the different modes of keyboard lighting. It's fine because I usually leave that turned off anyway. I could probably find a way to get it to work, but I don't really care to.", "The fans are quiet, the keyboard feels positive and comfortable, the display is very good. I have no complaints.", "I love it good PC", "Todo muy bien, se recomienda", "playing diablo2 resurected. it works fine", "This laptop is such an upgrade ...my absolute favorite is the multiple -colored backlit keys that scroll ever so gently while I'm working...pretty jewel tones add a super -rich touch...the keys are so great to see and access...the laptop has a good solid weight to it...the sound is really great...the HD quality is there for sure.", "I could go on and on about this laptop, but you need to buy it and enjoy it for yourself."]},
{"name": ["DVR", "Francisco Nava", "Francisco Nava", "Brian J Verrone", "Cee S Bee", "Cee S Bee", "Wynter ", "Wynter ", "Christina", "Derek Howell", "Dess", "Luke Andre Lefebvre", "YZ", "YZ"], "title": ["Good value!", "Problema con sonido...", "Update the wifi driver.", "First gaming laptop I ever owned", "Runs beautifully!", "Awesome 👏", "Great Beginner Gaming Laptop", "Perfect for The Sims 4", "Amazing laptop for mild gaming", "Not sure yet…"], "date": ["Reviewed in the United States on September 3, 2022", "Reviewed in the United States on October 27, 2022", "Reviewed in the United States on September 11, 2022", "Reviewed in the United States on October 13, 2022", "Reviewed in the United States on July 14, 2022", "Reviewed in the United States on November 19, 2022", "Reviewed in the United States on October 19, 2022", "Reviewed in the United States on July 25, 2022", "Reviewed in the United States on October 10, 2022", "Reviewed in the United States on December 22, 2022"], "body": ["It works great!  I do not use it for gaming.  The laptop came with 8GB of RAM.  I immediately added another 8GB.  I highly recommend it, unless you are a serious gamer needing a better graphis card.", " Decepcionado.", "Al encenderla y realizarle las pruebas, todo bien en cuanto a rendimiento, brillo de la pantalla, sensaciones de teclado, etc. El sonido fue lo único que presentó problemas. El altavoz de la derecha se escuchaba mal como se aprecia en el video. Adicional a la laptop compré un módulo de memoria RAM y un M.2 para, apenas llegara, instalarlas. Al hacer eso me percaté de que un tornillo estaba sobre el altavoz como se muestra en la foto. Una vez retirado el tornillo (y otro que estaba cerca de los slots de memoria RAM), el problema fue corregido.", "Por el tamaño de los tornillos, pareciera que fueran de los que sujetan la tarjeta madre al chasis de la laptop. De ser así, y al ser un equipo nuevo, me parece un poco descuidado por parte de ASUS, que equipos así lleguen a los clientes.", "PD: ASUS es mi marca predilecta en lo que a equipos portátiles y tarjetas gráficas se refiere.", "PPD: No apelé a garantía porque no vivo en EEUU, y, el proceso sería bastante demorado y costoso por mi parte.", "Works great after updating the wifi driver. Before the update it would keep dropping connection. Wish it had 16g ram but not a big deal. Otherwise great laptop so far.", "I purchased this laptop to replaced my old ASUS laptop,I needed something faster and runs smoother however I do have to add more ram because it does slows down and sometimes freeze. I wasn’t intended to use it for gaming I just wanted it for normal internet browsing,and also using it when I’m live streaming for twitch that’s about it. It’s a beautiful laptop I definitely like it very convenient for me.", "As someone who has always owned crappy laptops, this is a major upgrade for a good price! I mainly got it to play Sims 4, and let me just say I have a bunch of cc and mods and it still runs super fast on the highest quality!! Once I run it up the computer does begin to get a little hot and the fan goes fast but it doesn’t really bother me. It has custom options to change color, speed, and effects for the keyboard. I personally didn’t experience any issues with the wifi or buttons. (For those of you who struggled with turning up and down volume or brightness, just press FN key at the same time :)!)", "Note: I DID upgrade ram from 8gb to 16gb. I don’t know much about computers and it was east to install. I was a little concerned because I noticed the heat shield for the ram slot was not aligned correctly, but it seems to work fine.", "Bought it for my husband & he loves it!!!", "Bought this PC for my 18 year old daughter as a beginner gaming laptop and the laptop handles World's of Warcraft, Sims, Seven Days to Die and many other large games flawlessly! Now we did upgrade the amount of R.A.M from 8Gb to 32Gb. But it's a great laptop.", " I purchased this laptop as a little upgrade from my old 2013 MacBook Air lol. The updates on my mac left me with zero gigs to run the game. With The Sims being a huge game including mods etc. it runs perfectly on this ASUS. Only thing I don’t like is the battery life but I’m assuming running the game for long will drain it. Oh and for those who are having trouble with the volume and brightness you have to hit FN and the button at the same time other wise you would have to download a app offered through Microsoft store to over ride that hope that helps. Over all good buy I plan to connect it to a curved monitor for a bigger view. I thought the brightness was bad but it’s actually not bad to my eyes if you think about it lol. Hope this review helps", "I play RuneScape on this computer, and thought about running WoW on it, but I doubt it has enough space for a game that big. Very well built laptop and runs smoothly so far, battery dies pretty quick. Overall great computer for the price, can’t beat ASUS!", " Not sure I will keep it… It seems Good on paper, but in reality the laptop as nice as it looks and feels the fans are really loud. It sounds like a plane on the runway about to lift off and the battery life not that great. POOR image resolution. Also, the processor is very, very slow and almost every task has an error…"]},
{"name": ["Joe", "Angelique", "Nick", "Nadia DeLuca", "Martin", "Donald June", "Valladian", "Jackson", "Jerry T.", "SY"], "title": ["Pretty fast", "Well built, unfortunate it has Windows 11 and such low RAM", "Install new wifi drivers when you can.", "Pretty good but battery life is terrible", "Very good for the price", "Awesome Computer", "Not a Windows 11 machine.", "Very good for the price", "Great laptop", "Great low budget gaming PC"], "date": ["Reviewed in the United States on November 14, 2022", "Reviewed in the United States on August 11, 2022", "Reviewed in the United States on August 26, 2022", "Reviewed in the United States on December 1, 2022", "Reviewed in the United States on August 11, 2022", "Reviewed in the United States on October 9, 2022", "Reviewed in the United States on October 6, 2022", "Reviewed in the United States on September 28, 2022", "Reviewed in the United States on October 21, 2022", "Reviewed in the United States on October 21, 2022"], "body": ["Using as a remote terminal", "Very beautiful laptop. The biggest gripes that I have with it though are the 8gb of RAM and the Windows 11 operating system. I will have to upgrade to 16gb of RAM and still have to decide whether to settle for Windows 11 or purposefully downgrade to Windows 10. Beyond that everything seems very well put together. Very excited to start playing games with this laptop since it has a better graphics card than any computer I've had in the past. I'm also glad they have a long warranty for 12 months and a possible warranty extension of an extra 3 months. I will be taking advantage of those.", "great gaming laptop but you just need to install new wifi drivers asap or else the connectivity bugs out.", "I honestly bought this product and had the best experience for it but I hope you really don’t need their laptop at work. I make games, this laptop lasted 3 hours before it shut down. I’ve had a better experience with a chromebook considering battery life.", "Obviously a 1650 won't be able to run the newest games at maximum settings but it's still a very good laptop.  I was able to play GTA V for a few hours without any issues.  I'll be testing it more extensively next time I go on vacation but for now it's 5 stars.  EDIT: I have now taken it on 2 vacations and played quite a few games on it, this laptop is still 5 stars for the price.  You can play pretty much anything on it for extended periods of time.", "Keep in mind I am not a true, hardcore gamer, I do not compete nor take games too seriously. This is a very good computer. Upgradable for memory and speed. Monitor has brilliant colors.  Setup went fast and easy.", "The configuration I purchased runs Windows 11 on an i5 10300h with a GTX 1650. The 1650 is not operating on Windows 11, even though it wasn't listed as one of the unsupported GPUs for the OS. Everything running off the 10300h's UHD graphics, and trying to download drivers for it has resulted in them failing to update in Windows 11 even after successfully being installed. ARK is specifically the game I was trying to run, but even World of Warcraft is now running on the chips integrated graphics rather than the GPU! So far no amount of tweaks or disabling of hardware has been able to correct this issue, and it seems other ASUS laptops running these parts are not fairing any better. The 1650 is showing up in the BIOS, but cannot be enabled in graphics settings. This basically turns this otherwise amazing laptop into a glorified Chromebook!", "As a last resort, I am currently doing a fresh install of Windows 10. If this doesn't fix the issue, nothing will. I will update my review with the results.", "EDIT: Unfortunately attempts to roll back the OS have not fixed the 1650's inability to be detected over the 10300h's onboard UHD graphics. The consensus seems to be the 1650 is just a poorly optimized card softwarewise, and official support for it is lackluster at best. I have returned the laptop for a full refund, which is a shame because I throughly enjoyed the build quality of this machine.", "Bottom line: If you are going to buy an ASUS TUF Laptop, make sure it is using an RTX 3000 series or similar Radeon discreet GPU.", "It’s a good laptop to use on the go especially for gaming just for small games nothing to big or new but it can most games good and the quality of the screen is great worth the 600", "This thing is fast and I don't even have the RAM maxed out. Bought an external cd drive to go with it.", "My first gaming laptop and very satisfied with it. I'm able to play world of warcraft with no problem."]},
{"name": ["gabriel", "lahyane", "Dailines Rios", "Brent", "Alexis", "Marcus Pereira", "Frankee", "JUSTIN", "Amazon Customer", "Wendyyyxd"], "title": ["completo sin fallas", "Happiness", "Really cooo design and runs smoothly", "BEST BUDGET LAPTOP", "Perfect for my son", "Great Gaming Laptop", "Absolutely perfect", "keep a fan on it or keep it in an ac room", "Great little gamer", "Great bu!!!"], "date": ["Reviewed in the United States on October 26, 2022", "Reviewed in the United States on October 24, 2022", "Reviewed in the United States on October 8, 2022", "Reviewed in the United States on July 8, 2022", "Reviewed in the United States on September 22, 2022", "Reviewed in the United States on October 11, 2022", "Reviewed in the United States on October 17, 2022", "Reviewed in the United States on October 10, 2022", "Reviewed in the United States on September 19, 2022", "Reviewed in the United States on October 23, 2022"], "body": ["lego correcto sin fallas ni ningún golpe en la caja", "My little bro was so so happy with thr laptop", "Only thing I dislike is windows 11. It does crash a lot! But besides that this laptop is perfect for me", "PROs:", "I honestly play old school RuneScape and now a days the game has been upgraded to High def. The cpu does get hot running it but I also did buy a cooler for the laptop other than that I normally play using GPU plug-in on RUNELITE. Runs perfectly fine. Quiet too. But once you tweak with the asus armory you can play any game how you like. IMO FPS is best.", "CONs:", "Eh, nothing really  it’s a budget gaming laptop that you can upgrade…", "BUT SURE WORTH It", "I bought this to upgrade my son from his previous laptop, which was a Mac. Absolutely worth the money, great investment. He loves to play online games and is having no issues running them.", "This is my third Asus gaming Laptop", "i absolutely trust the brand and quality", "It's exactly what I wanted and it works great", "Really good product,I use it for normal stuff and not for games", "This is a great little machine, I bought it for my 16 year old daughter, and for the price, it is just a magnificent machine. Great value..", "great product!"]},
{"name": ["Fabiane Orsi Tossi", "J.Baucum", "Maxx Hudson", "Maxx Hudson", "sean cherry", "Marshall Willett", "KYPROS SIDERAS", "Ana V.", "Angi", "Platinum Dragon Inc", "Hope Donnellan"], "title": ["No internet cable connection entrance", "Great budget laptop for gaming.", "Exactly as Described", "its ok", "Asys", "looks", "Tarjeta de video dañada", "Great price, great quality!", "Good Item", "Would be a decent computer if not for a faulty Wi-fi 6 adapter"], "date": ["Reviewed in the United States on November 3, 2022", "Reviewed in the United States on October 14, 2022", "Reviewed in the United States on September 4, 2022", "Reviewed in the United States on June 30, 2022", "Reviewed in the United States on September 7, 2022", "Reviewed in the United States on October 10, 2022", "Reviewed in the United States on January 6, 2023", "Reviewed in the United States on August 31, 2022", "Reviewed in the United States on September 1, 2022", "Reviewed in the United States on June 12, 2022"], "body": ["If you need to connect it to an internet cable, there's no entrance.", "Great budget laptop for gaming. Easy to upgrade.", "Worth every penny! If I had to come up with 1 con it would be that the USB slots are pretty tight and sometimes difficult to use. Looks really sleek and performs great.", "track pad is trash", "Asus has always been my top choice for a budget friendly laptops they give you more than relative to HP and Dell. Gateway is trash.", "perfect product", "Bueno muy bonita, funciona bastante bien.. Pero la tarjeta de video vino dañada, no la reconoce en ningún momento..  Intente conectar otro monitor al hdmi y allí fue donde note que no funcionaba. Descargue el driver directo de la página de Asus, la reinicie de fábrica pero nada funciona. Ya paso la ventana de devolución.", "Recomiendo que hagan todas sus pruebas apenas la reciban y no pierdan el tiempo.", "We bought this for our teenage son. We homeschool him and he's a gamer. Very satisfied with this purchase.", "Completely happy with the purchase of this laptop. It is good for my business using", "There are a lot of things that are pretty decent with this computer. It's relatively fast, it's a little bulkier and feels more durable than my last laptop (and as a person prone to knocking their laptop into the desk whenever I take it out of its bag, this is wonderful), and the keyboard feels really nice to type on. The screen is easier on the eyes when I have long days at work than my previous laptop, since it seems to emit more red light. The fan makes the computer sound like it's taking off when it comes on, but it doesn't last long and it's very quiet when doing normal work or college tasks - typically only comes on when loading a game or downloading.", "However, the Wi-Fi adapter has been a pain since I got it. Unable to play any games without being disconnected shortly after the loading screen. Google docs is continuously \"reconnecting.\" I couldn't stream a live event (that I had to take notes on for work) without buffering every 3-10 seconds, however other devices worked perfectly fine with the same internet connection. I tried the internet at my work, my house, and at my father's house, same results. I have spent a long while trying to figure out how to troubleshoot, update the driver, etc. for the adapter (MediaTek Wi-Fi 6 MT7921) on my own (granted, I have very little computer knowledge), stumbled across multiple forums that had the same issue with it, and now I'm getting help from my second IT support, and still have yet to resolve the problem.", "It seems that you may get lucky and not have this issue if you buy this laptop based on other reviews, but if I was able to go back I wouldn't have purchased this one. I would avoid this laptop just in case you end up with the same problem I and some others have had. Hopefully I can get this issue fixed, since I don't have the money to purchase another at the moment, and I very much need it for my job and college (and games on the weekends)."]},
{"name": ["Leon On", "Leon On", "Roberto murguia", "Amazon Customer", "Edwin Ocasio", "Marie-Faustine", "Jennifer", "Jennifer", "Kit Robin", "D.Ro.N.", "Al", "Al", "Irma"], "title": ["So Cool", "excellent product", "Awesome", "Very nice", "Storage is not what is in the description.", "Llego a tiempo.", "Piece of junk right out the box that wouldn't stop crashing after barely using it", "Poor Battery.", "Muy buena máquina", "Horiible"], "date": ["Reviewed in the United States on August 25, 2022", "Reviewed in the United States on September 16, 2022", "Reviewed in the United States on September 16, 2022", "Reviewed in the United States on September 6, 2022", "Reviewed in the United States on September 5, 2022", "Reviewed in the United States on August 21, 2022", "Reviewed in the United States on November 1, 2022", "Reviewed in the United States on November 30, 2022", "Reviewed in the United States on August 12, 2022", "Reviewed in the United States on December 25, 2022"], "body": ["Everything look amazing but RAM 8GB. You need pay more to upgrade.", "excellent buy", "Good", "Everything is working accordingly", "The computer came with 453gb. I know it's never 512gb but more than 60gb of difference is a bit too much", "Buen rendimiento, y vino bien protegido, lo entregaron a tiempo.", "I was hoping maybe that it was a small percentage of people who would have problems with this laptop. However as soon as I got it out of the box and started to attempt to use it, I could tell something was amiss. This thing was way too slow at bootup to be running off an SSD, and the problems kept getting worse. It started locking up just by trying to look at tasks on the taskbar. Then the computer kept crashing with a bluescreen that \"something went wrong\" and then I needed to restart. Okay, I'll restart. Hopefully that would fix the problem. Nope, shortly after another \"something went wrong\". After this happened about 3 times, the computer wouldn't even finish the bootup anymore, and it wouldn't even start windows at all.", "I immediately put in for a return, because that is such garbage to get a brand new computer and deal with those kind of problems in less than an hour of trying to get it set up.", "Also, I'm still waiting for my refund. How amazon can send me an item and get same day delivery, yet it takes 3-4 days for a return to arrive is beyond me. I would like my money back, I don't appreciate giving amazon a free loan since I basically got a paper weight in the mail.", "I have been with this laptop for four days. I'm not an expert. I can already say that the battery does not last more than 4 hours. Which is the worse of all my older laptops (I have a Macbook Air, a Lenovo, and a Toshiba). Performance is fair, and nothing to be very excited about. I'll update you with more information about speed...", "Envio rápido. Excelente función.", "Been turning it on and trying to fix the crashing for 2 hours straight it has good graphics for games but what’s the point if you can’t even open them"]},
{"name": ["JuanLesPablo", "Alex", "levi", "Pedro", "Cliente de Amazon", "Alexis Suarez", "Alex", "Alex", "K. Snead", "Caribbean reader", "Caribbean reader", "A person :/ "], "title": ["Excelente pc", "Worth it, for entry but could use more ram", "Muestra fugas de luz...", "Exelente calidad precio.. queremos Amazon en ecuador 🥲", "Nice", "Es un buen equipo pro", "Glorified cheap pc, save yourself the trouble", "black screen after a month", "Poor resolution of faulty items", "Poor quality laptop. Not happy"], "date": ["Reviewed in the United States on June 28, 2022", "Reviewed in the United States on May 31, 2022", "Reviewed in the United States on June 14, 2022", "Reviewed in the United States on June 21, 2022", "Reviewed in the United States on May 18, 2022", "Reviewed in the United States on May 7, 2022", "Reviewed in the United States on November 1, 2022", "Reviewed in the United States on June 28, 2022", "Reviewed in the United States on October 13, 2022", "Reviewed in the United States on May 27, 2022"], "body": ["Buena calidad y excelentes gráficos aunque la batería se agota rápido sin el cargador", "I like it, Only issue is due to low ram amount it may crash during overload. Also MAKE SURE TO UPDATE EVERYTHING! It may be obvious but if you don't it will constantly crash and freeze", "Muestra fugas de luz... Aunque no es algo que afecte en uso general, pero cuando muestra colores oscuros se nota", "Moderna y práctica", "Good", "Es un buen equipo y cumple para su función perfectamente, mi equipo presento un pequeño problema con su batería ya que dura menos de 1h estando en ahorro de energía y sin funciones activas y uso de redes sociales y videos.", "El soporte que brinda Amazon es horroroso, no saben decir otra cosa que no sea realizar la devolución, lo cual acarrea perdida de mucho tiempo.", "El equipo bueno, la atención y soporte por parte de Amazon un horror", "Had to return after the day I got it, it was really disappointing had high hopes on it, first day of use just working on pdf documents it crashed on me 5 times, called support and they made me download and install like 5 drivers and more stuff, I was thinking it would get better but it won’t, really tried giving all the chances to it and following all the trouble shooting solutions I could find but I just cannot make it work decently, don’t even try any game, it won’t work and will crash on you, save the upset and buy another brand better", "A sus computer... that's for sure. Unit will no longer boot. Screen stays black, fan turns on, backlit keypad cycles through rgbs. Contacted ASUS, sending the unit back to be wiped and os reinstalled to secure my data. Return window expired on Amazon but they are allowing me to return the product. Never had a computer completely fail so quickly, so disappointed.", "As far as performance was concerned the fan was extremely loud. To the point it actually hurt my ears. I'll be happy when this $800 brick is out of my life forever. Asus customer service was alright but who would trust a product that failed after a month of soft use? No point in repairing it under warranty, I have no faith in this product", "I purchased this laptop for school and within a week of purchase the laptop is not charging. Attempted to reach out to customer support and they were limited in the support they could offer. As someone who is being inconvenienced with this faulty laptop they could have at least offered some sort of support or incentive to remain with the brand they didn't and I would be returning forthwith", "I bought this laptop for work and when it came in, the volume buttons didnt work, the brightness buttons didnt work, i couldnt acess the settings panel through the windows tab. I couldnt even change the rbg lights on the keyboard which are are supposed to be able to with a REAL one. It's a waste of your time to get one of these. They deleted my old review because they said it went against community guidelines but it didnt at all."]},
{"name": ["Josh Horst", "Hyperstrike", "Aysha Duran", "valerie crownover", "Diana lucia cotte", "Diana lucia cotte", "retsan", "The Buffalo Tibber", "Juan Manuel Campoverde ", "Katie Welch", "Abel Muñoz"], "title": ["Defective", "Decent price.  Some caveats.", "Limited battery life", "Where is the dvd player!??", "Producto defectuoso", "Charger??", "Hard to set up", "Me vino con error se fabrica", "Never got to use it.", "Sin WebCam"], "date": ["Reviewed in the United States on October 12, 2022", "Reviewed in the United States on January 7, 2023", "Reviewed in the United States on October 11, 2022", "Reviewed in the United States on September 9, 2022", "Reviewed in the United States on June 29, 2022", "Reviewed in the United States on June 9, 2022", "Reviewed in the United States on September 11, 2022", "Reviewed in the United States on August 23, 2022", "Reviewed in the United States on June 14, 2022", "Reviewed in the United States on November 18, 2022"], "body": ["This is absolutely ridiculous, 3 hour Low battery life and won't connect to wifi", "This is a well laid out system with lots of expandability.", "2 M.2 SSD slots. 2 SODIMM slots (comes with a single stick, moving to dual stick is inexpensive and DEFINITELY enhances performance).", "So if you want to rock 64GB of RAM and 8TB of SSD space?  YOU CAN.", "General layout is quite self-serviceable.", "The video's no 4090.  But you're on a 15\" screen.  You don't have to drive it that hard.", "There is one caveat.", "Asus advertised the laptop with a 90Whr battery.", "Dissection of the device shows it's a 48Whr battery.", "So lifespan of the device will be less than expected.", "But if you're working with it plugged in most of the time, this matters not at all.", "That being said, the battery is EASILY replaceable if need to.", "Too heavy 2, 3 hours battery life", "I loved the computer but I cannot find the DVD player anywhere", "Lastimosamente el producto llegó dañado, no fue posible solucionarlo ni con la marca ni con Amazon, cabe destacar que la gestión que hizo Amazon fue la mejor.", "Why there is an AC-type charger?? I can not use an AC type of charger in the US.", "Disappointed...", "Now I need to buy a tool to run my laptop... :(", "No Alexa ? It seems that it is incomplete.", "No servia la tarjeta gráfica , tuve que devolver", "Product came with someone else's account as administrator and had to be sent back. Screen barely stayed on while I tried to troubleshoot.", "Una portátil en el año 2022 y sin webcam?"]},
{"name": ["Corey Sinopoli", "Michael", "Paul", "S. Warner", "Mark Richard", "Jason Lenaghan", "ozpen", "Tek", "Hunter Hary", "Falling Leaves Kung Fu"], "title": ["Horrible costumer service", "It’s perfect gaming laptop", "It's fast and fits all my needs", "Great, affordable gaming computer-works with 3-D printers too!", "Works very well.", "Solid low end gaming machine", "Lucky Amazon Tech Find", "A solid purchase", "Great gaming Laptop", "More SSD"], "date": ["Reviewed in the United States on November 6, 2022", "Reviewed in the United States on June 2, 2022", "Reviewed in the United States on August 12, 2022", "Reviewed in the United States on January 2, 2023", "Reviewed in the United States on September 25, 2022", "Reviewed in the United States on October 26, 2022", "Reviewed in the United States on September 13, 2022", "Reviewed in the United States on January 2, 2023", "Reviewed in the United States on September 27, 2022", "Reviewed in the United States on September 26, 2022"], "body": ["My monitor broke, the company told me they will pay to have it shipped out. The carrier asus picked, packaged the monitor like crap and handled it like crap. It arrived to asus's repair facility shattered and bent to all hell. Asus messaged me saying that my warranty doesn't cover the condition that the monitor arrived in....needless to say it's apparently all my fault and I have to now buy a new monitor while paying off the old one. Don't waste your time with this company they will treat you like trash.", "This laptop runs Warcraft shadow lands on high performance setting it’s a great little gaming machine runs smooth. Easily upgraded with 2nd drive and second memory stick.Back opens easily for access. I’m impressed with it.", "Love the sleek design, very gaming worthy", "I love this computer!  It has everything you need with a great graphics card, good storage room and Windows 11. I'm using it primarily with my 3D printer, but it's great and fast for gaming too!", "Affordable quality and functionality. This is a great computer!", "Unready speed and great picture quality. For the 144hz it would be nice to have screen a little brighter", "Received this and immediately went to town getting all my stuff installed and together.  First thing I noticed was that the fan is pretty aggressive.  Built in software can help with that a bit by tuning it for what you're doing.  Still audible, but just fine in my opinion.  Everything runs pretty smooth, until you get to some more intense games.  I think the 8GB of RAM is just a little on the low side and I suspect adding some more will do wonders.", "Screen is good, I've seen some qualms about brightness and indeed this doesn't go as bright as some others, but I found it not to be a problem at all and wouldn't have noticed if someone hadn't told me.", "Expansion is super easy.  Added a 2.5\" SSD right off the bat and it was done in about 5 minutes.", "Relative had asked me to find a suitable laptop for them since theyre returning to school, initially I was looking for a Lenovo like my own but for some reason those dissappeared a month prior. Anywho the other Lenovos were not to my favor with price to specs so I looked into ASUS as the next best thing, low and behold ASUS TUF gaming laptop!", "Ive recommended TUF gaming laptops before to friends since they offer some solid specs for a decent price and this one was no different, 144hz, 1080p display with a 1650 dedicated graphics card and with a solid 10th gen i5? For $600 (at the time of purchase)?! I immediately pushed for my relative to get it and Im kinda jealous I hadn't found this for myself earlier.", "(Lenovo thinkpad with ryzen 5 5000.)", "The TUF laptop itself comes with an m.2 ssd for the boot drive with a slot for a 2nd m.2 and even space (and adapter) for a 2.5 inch hard drive! It does however only come with 8Gb of RAM with a 2nd slot for additional RAM (I recommend Crucial's 8Gb 3200mhz kit, its only about $23 at the time of this review.)", "Unfortunately this also ships with Windows 11, not the biggest fan but its workable.", "TLDR if you're needing a new laptop for school this season, I recommend this laptop for the $600 price tag for solid performance with room for upgrades!", "So I bought this upgrading from a $300 laptop and I gotta say this is definitely worth the purchase. It can run games like League, Valorant, and others at high graphics with barely any heating and definitely no lags or skips. It does become noticeably loud with the fans if you plug it in and do just about anything but it does not lag or skip. The battery life is probably the only complaint, it’s out in maybe an hour or two max so it does need multiple charges but that was the case for most the laptops I used anyway. It probably maxes out at large games like Apex and Fortnite, or other large map games I haven’t played. It’s good for mid scale gaming imo and I couldn’t be more satisfied. The display and audio is good. I can’t seem to use any of the top most keys to control the laptop though but I also haven’t read the guide so idk. Would recommend if you’re looking for decent gaming experience but not for 24/7 heavy gaming", "As my first gaming laptop I couldn’t be happier. I bought this on sale for just under $600. 8gb ram, I added a 4gb stick I had in a damaged laptop and now have 12gb ram (which has worked just fine and I have noticed the increase in speed). 500gb SSD that I just upgraded with another 512gb SSD for $43. I have played halo infinite and it looks great. Looks as good as it did when using the Xbox series S. This laptop upgrades easily. I put the ram in and then the SSD in under 5 minutes. Seems solid, not flimsy. Haven’t noticed screen brightness issues. Have used for job interviews using Microsoft teams and the camera and speakers and mic work great. Overall very happy. You don’t need to spend thousands to get a good gaming rig and work/education rig.", "A gaming laptop that handles games that my kids can no life for like... apparently life?", "Anyway, I love the speed and haven't actually played one of the many downloaded games yet but would want more SSD to do so because WoW. But no complaints so far. So TUF! Gotta survive these teenage jerks."]},
{"name": ["Swift Reply", "Jaun Erasmus", "James L Smith", "Freddy", "Kamo", "John Fisher", "Callum Creed", "Dzengis ", "Dwright", "Clv"], "title": ["Revised , I shipped it back", "Amazing", "Gaming laptop", "Great performance for the price for a casual gamer", "FAN IS VERY LOUD", "smoking lap top", "This is the last time I'm buying a laptop online.", "The laptop was damaged the fan", "Good", "Love the laptop so far"], "date": ["Reviewed in the United States on October 5, 2022", "Reviewed in the United States on September 12, 2022", "Reviewed in the United States on September 20, 2022", "Reviewed in the United States on November 5, 2022", "Reviewed in the United States on December 12, 2022", "Reviewed in the United States on January 2, 2023", "Reviewed in the United States on November 12, 2022", "Reviewed in the United States on November 27, 2022", "Reviewed in the United States on October 4, 2022", "Reviewed in the United States on July 17, 2022"], "body": ["The arrow keys are tiny , key board lights up bright . Color is great loAd time for game is slow compared to my acer predator an MSI other then that once game is on it can hold its own . Revised So I had this laptop for a few days now an while idling on a game MapleStory it starts to freeze on me an having to shut the laptop off just to exit the full screen window . I thought it might be getting hot which that's not the case here even restarting it the laptop freezing on start up . Thinking I have to ship it back .", "It is just what i was looking for. Amazing laptop", "I love it second best thing I brought", "This laptop is great for the price. I had Prime so I got same day delivery. I am not disappointed a few weeks in. It is suitable for my gaming needs which are casual, but if you’re a hardcore gamer you should get a better laptop or upgrade this one. It has Windows 11 which I was not used to but it’s not too different than 10. I have played Overwatch 2 on ultra settings and it runs well. As expected the battery life is not great and the fan is loud on high performance mode. Also the SSD is not huge and it fills up quickly - again this is good for a casual gamer looking for a good deal. This laptop has an Ethernet port and 3 standard USB ports, a USB-C, and an HDMI, and a headphone Jack which was perfect for me. It comes with some antivirus programs which you can uninstall easily via add or remove programs if you don’t want them. The laptop works well with an Asus low latency monitor that I have. It is a very fast laptop and I have no major complaints so far.", "I've had this laptop for a few days and it is a huge upgrade from my other slow school laptops and I think it's perfect, Runs most games from Xbox gamepass runs fortnite and etc.", "The fan is very loud though but if you have headphones you'll be fine", "comes with 453 GB, The screen is very bright and hurts my eyes i'd suggest keeping the night light on, battery life is decent dies fast charges fast so can't complain Very large screen compared to my other windows 10 laptops, Very cool laptop i love it", "outstanding speed", "This is the third laptop I've bought in the space of a year trying to replace lemon junk machines, pretty much just one right after the other. Really tired of it. Do yourself a favor, and go somewhere in person, and actually look at what you're buying and try it out for yourself before dropping $600 on a laptop that doesn't run nearly as well as is advertised.", "The laptop was damaged it was making the noise in the fan and the hard drive. I guess somebody dropped it once I go to the first day I call for a return label.", "Nothing bad to say I've played like 4 to 5 games on this and it's a good deal plays newest stuff on good fps I'm really happy and impressed w this laptop so far", "I am a teacher and bought this to put some education software on and use for personal use. The lighted keyboard is awesome and I am totally happy with my purchase so far."]},
{"name": ["Leon", "Leon", "Diego Sánchez", "Mauricio Chan", "Mauricio Chan", "Ethan Rivas", "Alejandro Aranda", "kraneo2500", "Alonso Contreras", "Daniel Olivares", "Guillermo Castañeda Ortiz", "Mario Haza"], "title": [], "date": ["Reviewed in Mexico on January 12, 2023", "Reviewed in Mexico on January 21, 2023", "Reviewed in Mexico on December 31, 2022", "Reviewed in Mexico on January 18, 2023", "Reviewed in Mexico on January 20, 2023", "Reviewed in Mexico on January 16, 2023", "Reviewed in Mexico on January 11, 2023", "Reviewed in Mexico on January 12, 2023", "Reviewed in Mexico on December 31, 2022", "Reviewed in Mexico on December 22, 2022"], "body": ["La computadora esta super genial, en lo estético es muy linda en un color negro cepillado, no es tan pesada como imagine y su pantalla y sonido soy demasiado buenos para su precio, su webcam esta bien para ser laptop y su teclado retro iluminado es configurable y sus teclas son muy ergonómicas y no son tan ruidosas. En cuanto a su funcionamiento va super bien, no eh tenido ningún inconveniente mueve varios programas para el estudio de manera fluida como los son: paquetería de Office, MATLAB,AUTOCAD y Simulink. Su batería dura entre 3 a 3 horas y media dependiendo el uso.", "No eh corrido muchos juegos en ella pero el Fall Guys va super fluido y al máximo sus configuraciones.", "Lo que no me agrada es que su teclado viene en ingles y la distribución de las teclas igual, pero eso se puede configurar y otra cosa es que no cuenta con un lector para memorias micro SD.", "La verdad super recomiendo esta laptop, es una chulada.", "El precio se me hace bastante accesible y es una máquina poderosa, puedes expandirse hasta 32 de ram ddr4 y trae un disco duro SSdPCle para el sistema operativo y un slot extra para otro disco duro con entrada SATA, también trae su tarjeta gráfica GeForce, sin duda alguna una excelente máquina", "Llevo dos semanas usando la lap, y la verdad que es excelente para el precio, estoy totalmente satisfecho, la calidad de imagen es muy buena, la lap es muy rápida es general, el teclado es bastante llamativo y cómodo, para juegos va muy bien, en algunos que he probado.", "El envío fue muy rápido, me llegó casi una semana antes de lo previsto y la lap sin ningún problema.", "Los únicos detalles son que si necesita expandir la memoria al menos a 16gb, le agregue otra memoria a los 3 días. Yo la estoy usando con varios discos externos así que el poco almacenamiento no me ha sido un problema, pero si recomendaría agregarle otro SSD. Otro un punto es la batería, que le dura entre dos y tres horas en un so básico sin jugar, aunque es de esperar para una lap Gamer.", "Hasta el momento todo bien. Únicamente funciona a su máxima capacidad utilizando conectado el equipo pero es algo que se ve en otras marcas/equipos similares.", "Muy buen artículo para jugar como para programas profesionales.", "Un buen equipo y lo compre a un buen precio.", "Me gusta le invertí una memoria de 8 gb de ram más", "Hace almenos dos meses compre este equipo, pero, quisiera aumentar la RAM del equipo ¿Cual es la que tengo que comprar que sea compatible? Gracias!", "TIENE UN EXCELENTE RENDMIENTO, JUSTO PARA LO QUE LA NECESITO", "Estoy muy convencido por el buen precio y sus características.", "Compré está laptop porque mi vieja estación ya me daba problemas, necesitaba algo con RAM, buen monitor, durable, expandible, teclado retroilumunado y SSD, estaba en descuento, la uso para programar"]},
{"name": ["Manuel Aldahir", "Raul Espejel Morales", "JORGE ALBERTO ARIZMENDI", "Ana Flores", "Alonso Hernandez", "Vielma", "GODDUKEMONEXA", "Fidel Ortega", "Fidel Ortega", "ROCIO AVILA", "Vicente Joel Onofre Valdes"], "title": [], "date": ["Reviewed in Mexico on December 21, 2022", "Reviewed in Mexico on December 27, 2022", "Reviewed in Mexico on December 14, 2022", "Reviewed in Mexico on January 3, 2023", "Reviewed in Mexico on December 31, 2022", "Reviewed in Mexico on December 15, 2022", "Reviewed in Mexico on December 28, 2022", "Reviewed in Mexico on December 13, 2022", "Reviewed in Mexico on December 21, 2022", "Reviewed in Mexico on December 7, 2022"], "body": ["LLego dos días antes de lo marcado y eso que soy de QuintanaRoo, en perfecto estado, y sin detalle por el momento, fue un regalo para mi hermana y quedo facinada, recomendado.", "Es ligera, y escalable", "Excelente compra, mi hijo esta encantado con la laptop, muy buen desempeño en forma general y con los juegos, la estetica del producto es muy buena, estoy completamente satisfecho con mi compra", "Está muy linda, y para mí fue una buena inversión, lo único es que no tiene ñ", "Es un buen producto con buenas especificaciones y capacidad para jugar, trabajar.", "Muy recomendada", "equipo lo q vale lo ofrece", " Excelente laptop para aquellos que se inician en el mundo del gaming, recomendada totalmente", "Me gustó mucho excelente, funciona bien 👌👌👌👌re comiendo a compra", "Para mis trabajos excelente", "Ideal para juegos"]},
{"name": ["Sebastian", "Sebastian", "FM", "ADRIAN CASTILLO", "ADRIAN CASTILLO"], "title": [], "date": ["Reviewed in Mexico on November 22, 2022", "Reviewed in Mexico on December 27, 2022", "Reviewed in Mexico on January 17, 2023"], "body": [" Excelente computadora, buen precio, muy rápida, la compré con una ram adicional y la verdad con 16 GB va sobrada, muy bonito el teclado y la calidad de materiales son excelentes.", "Lo malo es su procesador i5 que es muy lento comparado con Ryzen 5. Y lo más molesto es sus continuos y repetidos avisos de programas precarfados para comprar proteccion antivirus de una marca predeterminada que no quiero.", "para  programación y es excelente"]}
]